## Target env: terraform/env
#### Terraform Init `success`
#### Terraform Validate `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.eks.data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.eks.data.aws_iam_policy_document.assume_role: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.cluster_encription_key.aws_kms_key.key: Refreshing state... [id=cc0ed338-8c27-4ca5-8127-9d223ed5d57a]
module.eks.data.aws_eks_cluster_auth.cluster_auth: Reading...
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-05ebe5960d956e801]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b53b80a66e1cf9a2]
module.eks.data.aws_eks_cluster_auth.cluster_auth: Read complete after 0s [id=ipro-2023-eks-cluster]
module.eks.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.eks.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=189502314]
module.eks.aws_iam_role.cluster: Refreshing state... [id=ipro-2023-role]
module.eks.data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
data.aws_caller_identity.current: Read complete after 0s [id=686355260515]
module.eks.aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=ipro-2023-role-20230711043350477800000001]
module.eks.aws_iam_role_policy_attachment.AmazonEKSVPCResourceController: Refreshing state... [id=ipro-2023-role-20230711043350625900000002]
module.cluster_encription_key.aws_kms_key_policy.key_policy: Refreshing state... [id=cc0ed338-8c27-4ca5-8127-9d223ed5d57a]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0dac557c13ec14ee9]
module.eks.aws_security_group.cluster_shared: Refreshing state... [id=sg-08bba39e96b2644e6]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0eb523e6ed3a7d25a]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0ef9d5a8b7de5ab89]
module.eks.aws_security_group.control_plane: Refreshing state... [id=sg-009d40c39faf7d383]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a4a1aff2595a20ac]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0ecf598f0e3697033]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03d498fb558bcfb0a]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-098d5cb57f7ff2bb1]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-079ad37617375f549]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-08521278642320fd6]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-014b7b0ea10e08859]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0bcbcc2fcde06bbc1]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0be564acee1846ce6]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-00caaf721b9098452]
module.eks.aws_security_group_rule.inter_node: Refreshing state... [id=sgrule-3597919367]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-085ddb300155ea52a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0c67c4af548815e71]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0cd6ec0bd561ffce6]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0f9173b57e210be49]
module.eks.aws_eks_cluster.cluster: Refreshing state... [id=ipro-2023-eks-cluster]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0be564acee1846ce61080289494]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0432895dcead45cf0]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05809f6ecffc8fbb9]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02ad6c7d9252b3d6d]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0bcbcc2fcde06bbc11080289494]
module.eks.data.http.cluster_oidc: Reading...
module.eks.data.aws_iam_policy_document.pod_execution_role: Reading...
module.eks.data.aws_iam_policy_document.pod_execution_role: Read complete after 0s [id=1722845150]
module.eks.aws_security_group_rule.node_to_default_cluster: Refreshing state... [id=sgrule-1628123416]
module.eks.aws_security_group_rule.default_cluster_to_node: Refreshing state... [id=sgrule-520505704]
null_resource.patch-coredns: Refreshing state... [id=8922369517139905981]
module.eks.aws_iam_role.pod_execution_role: Refreshing state... [id=ipro-2023-pod-execution-role]
kubernetes_cluster_role_binding.viewer: Refreshing state... [id=eks-console-dashboard-full-access-binding]
kubernetes_cluster_role.viewer: Refreshing state... [id=ViewerClusterRole]
module.eks.aws_iam_role_policy_attachment.pod_execution_role_ecr: Refreshing state... [id=ipro-2023-pod-execution-role-20230711044052815900000007]
module.eks.aws_iam_role_policy_attachment.pod_execution_role: Refreshing state... [id=ipro-2023-pod-execution-role-20230711044052656700000005]
aws_eks_fargate_profile.app_eks_node: Refreshing state... [id=ipro-2023-eks-cluster:ipro-2023-app-fargate-profile]
aws_eks_fargate_profile.kube-system_eks_node: Refreshing state... [id=ipro-2023-eks-cluster:ipro-2023-kube-system-fargate-profile]
module.eks.data.http.cluster_oidc: Read complete after 0s [id=https://oidc.eks.ap-northeast-1.amazonaws.com/id/53BECD3BF06E3F9B16577418241240F8/.well-known/openid-configuration]
module.eks.data.tls_certificate.cluster_oidc: Reading...
module.eks.data.tls_certificate.cluster_oidc: Read complete after 1s [id=876ec6096b3f2e9d22b7016d735a7689929468a2]
module.eks.aws_iam_openid_connect_provider.cluster: Refreshing state... [id=arn:aws:iam::686355260515:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/53BECD3BF06E3F9B16577418241240F8]
module.eks.data.aws_iam_policy_document.assume_role_policy: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=3523009562]
module.eks.aws_iam_role.oidc: Refreshing state... [id=eks-odic-role]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubernetes_config_map.aws_auth will be created
  + resource "kubernetes_config_map" "aws_auth" {
      + data = {
          + "mapAccounts" = <<-EOT
                - "686355260515"
            EOT
          + "mapRoles"    = <<-EOT
                - rolearn: "arn:aws:iam::686355260515:role/ipro-2023-pod-execution-role"
                  username: "system:node:{{SessionName}}"
                  groups:
                    - system:bootstrappers
                    - system:nodes
                    - system:node-proxier
            EOT
          + "mapUsers"    = <<-EOT
                - userarn: "arn:aws:iam::686355260515:user/naruse"
                  username: naruse
                  groups:
                    - eks-console-dashboard-full-access-group
                    - system:masters
                - userarn: "arn:aws:iam::686355260515:user/cli-user"
                  username: admin
                  groups:
                    - user
            EOT
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "aws-auth"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # null_resource.patch-coredns must be replaced
-/+ resource "null_resource" "patch-coredns" {
      ~ id       = "8922369517139905981" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "token"    = (sensitive value)
            # (2 unchanged elements hidden)
        }
    }

  # module.cluster_encription_key.aws_kms_key_policy.key_policy will be updated in-place
  ~ resource "aws_kms_key_policy" "key_policy" {
        id                                 = "cc0ed338-8c27-4ca5-8127-9d223ed5d57a"
      ~ policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::686355260515:user/cli-user"
                        }
                      - Resource  = "*"
                      - Sid       = "EKS Cluster Encription Key"
                    },
                  - {
                      - Action    = [
                          - "kms:DescribeKey",
                          - "kms:Get*",
                          - "kms:ListResourceTags",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::686355260515:role/AllowAccessFromIpro2023"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow use by github actioins"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> "\"{\\n    Statement = [\\n      {\\n        Action = \\\"kms:*\\\"\\n        Effect = \\\"Allow\\\"\\n        Principal = {\\n          \\\"AWS\\\" = arn:aws:iam::686355260515:root\\\"\\n          }\\n\\n        Resource = \\\"*\\\"\\n        Sid      = \\\"EKS Cluster Encription Key\\\"\\n      },\\n    ]\\n    Version = \\\"2012-10-17\\\"\\n}\\n\""
        # (2 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>